Results/Verifications/S2427/update_index/tidb-server-thead-c906.sysbench.log
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 12
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 12 tps: 2515.15 qps: 2515.15 (r/w/o: 0.00/2452.88/62.27) lat (ms,95%): 8.28 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 12 tps: 2696.94 qps: 2696.94 (r/w/o: 0.00/2633.53/63.40) lat (ms,95%): 7.70 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 12 tps: 2808.31 qps: 2808.31 (r/w/o: 0.00/2735.71/72.60) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 12 tps: 2872.13 qps: 2872.13 (r/w/o: 0.00/2801.53/70.60) lat (ms,95%): 7.04 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 12 tps: 2923.40 qps: 2923.40 (r/w/o: 0.00/2850.50/72.90) lat (ms,95%): 6.91 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 12 tps: 2846.88 qps: 2846.88 (r/w/o: 0.00/2777.28/69.60) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 12 tps: 2884.32 qps: 2884.32 (r/w/o: 0.00/2814.52/69.80) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 12 tps: 2821.87 qps: 2821.87 (r/w/o: 0.00/2748.57/73.30) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 12 tps: 2863.93 qps: 2863.93 (r/w/o: 0.00/2793.43/70.50) lat (ms,95%): 7.04 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 12 tps: 2923.58 qps: 2923.58 (r/w/o: 0.00/2847.98/75.60) lat (ms,95%): 6.91 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 12 tps: 2843.80 qps: 2843.80 (r/w/o: 0.00/2774.60/69.20) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 12 tps: 2873.32 qps: 2873.32 (r/w/o: 0.00/2799.32/74.00) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 12 tps: 2719.58 qps: 2719.58 (r/w/o: 0.00/2656.68/62.90) lat (ms,95%): 7.70 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 12 tps: 2745.79 qps: 2745.79 (r/w/o: 0.00/2675.79/70.00) lat (ms,95%): 7.56 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 12 tps: 2858.42 qps: 2858.42 (r/w/o: 0.00/2784.32/74.10) lat (ms,95%): 7.04 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 12 tps: 2495.88 qps: 2495.88 (r/w/o: 0.00/2439.28/56.60) lat (ms,95%): 8.58 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 12 tps: 2427.49 qps: 2427.49 (r/w/o: 0.00/2367.89/59.60) lat (ms,95%): 9.06 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 12 tps: 2915.92 qps: 2915.92 (r/w/o: 0.00/2844.52/71.40) lat (ms,95%): 6.91 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 12 tps: 2783.10 qps: 2783.10 (r/w/o: 0.00/2718.60/64.50) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 12 tps: 2867.19 qps: 2867.19 (r/w/o: 0.00/2797.39/69.80) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 12 tps: 2935.70 qps: 2935.70 (r/w/o: 0.00/2863.50/72.20) lat (ms,95%): 6.79 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 12 tps: 3011.19 qps: 3011.19 (r/w/o: 0.00/2937.49/73.70) lat (ms,95%): 6.32 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 12 tps: 2987.61 qps: 2987.61 (r/w/o: 0.00/2914.71/72.90) lat (ms,95%): 6.32 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 12 tps: 2869.10 qps: 2869.10 (r/w/o: 0.00/2798.10/71.00) lat (ms,95%): 6.67 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 12 tps: 2743.72 qps: 2743.72 (r/w/o: 0.00/2673.72/70.00) lat (ms,95%): 7.56 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 12 tps: 2888.58 qps: 2888.58 (r/w/o: 0.00/2816.48/72.10) lat (ms,95%): 7.04 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 12 tps: 2740.20 qps: 2740.20 (r/w/o: 0.00/2676.60/63.60) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 12 tps: 2717.50 qps: 2717.50 (r/w/o: 0.00/2651.70/65.80) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 12 tps: 2496.60 qps: 2496.60 (r/w/o: 0.00/2436.20/60.40) lat (ms,95%): 8.74 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 12 tps: 2758.82 qps: 2758.82 (r/w/o: 0.00/2689.62/69.20) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 310s ] thds: 12 tps: 2760.18 qps: 2760.18 (r/w/o: 0.00/2690.28/69.90) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 320s ] thds: 12 tps: 2292.21 qps: 2292.21 (r/w/o: 0.00/2233.31/58.90) lat (ms,95%): 9.73 err/s: 0.00 reconn/s: 0.00
[ 330s ] thds: 12 tps: 2878.30 qps: 2878.30 (r/w/o: 0.00/2806.00/72.30) lat (ms,95%): 7.04 err/s: 0.00 reconn/s: 0.00
[ 340s ] thds: 12 tps: 2811.19 qps: 2811.19 (r/w/o: 0.00/2743.99/67.20) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 350s ] thds: 12 tps: 2919.80 qps: 2919.80 (r/w/o: 0.00/2847.50/72.30) lat (ms,95%): 6.91 err/s: 0.00 reconn/s: 0.00
[ 360s ] thds: 12 tps: 2836.80 qps: 2836.80 (r/w/o: 0.00/2766.20/70.60) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 370s ] thds: 12 tps: 2860.50 qps: 2860.50 (r/w/o: 0.00/2793.30/67.20) lat (ms,95%): 7.04 err/s: 0.00 reconn/s: 0.00
[ 380s ] thds: 12 tps: 2806.60 qps: 2806.60 (r/w/o: 0.00/2734.50/72.10) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 390s ] thds: 12 tps: 2845.49 qps: 2845.49 (r/w/o: 0.00/2774.29/71.20) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 400s ] thds: 12 tps: 2685.02 qps: 2685.02 (r/w/o: 0.00/2622.22/62.80) lat (ms,95%): 7.98 err/s: 0.00 reconn/s: 0.00
[ 410s ] thds: 12 tps: 2726.58 qps: 2726.58 (r/w/o: 0.00/2660.58/66.00) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 420s ] thds: 12 tps: 2655.42 qps: 2655.42 (r/w/o: 0.00/2593.22/62.20) lat (ms,95%): 7.84 err/s: 0.00 reconn/s: 0.00
[ 430s ] thds: 12 tps: 2731.09 qps: 2731.09 (r/w/o: 0.00/2662.19/68.90) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 440s ] thds: 12 tps: 2903.10 qps: 2903.10 (r/w/o: 0.00/2831.10/72.00) lat (ms,95%): 6.67 err/s: 0.00 reconn/s: 0.00
[ 450s ] thds: 12 tps: 2758.10 qps: 2758.10 (r/w/o: 0.00/2690.10/68.00) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 460s ] thds: 12 tps: 2811.80 qps: 2811.80 (r/w/o: 0.00/2743.10/68.70) lat (ms,95%): 7.04 err/s: 0.00 reconn/s: 0.00
[ 470s ] thds: 12 tps: 2724.09 qps: 2724.09 (r/w/o: 0.00/2656.49/67.60) lat (ms,95%): 7.56 err/s: 0.00 reconn/s: 0.00
[ 480s ] thds: 12 tps: 2834.03 qps: 2834.03 (r/w/o: 0.00/2763.33/70.70) lat (ms,95%): 6.91 err/s: 0.00 reconn/s: 0.00
[ 490s ] thds: 12 tps: 2850.69 qps: 2850.69 (r/w/o: 0.00/2781.79/68.90) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 500s ] thds: 12 tps: 2885.40 qps: 2885.40 (r/w/o: 0.00/2817.50/67.90) lat (ms,95%): 7.04 err/s: 0.00 reconn/s: 0.00
[ 510s ] thds: 12 tps: 2857.80 qps: 2857.80 (r/w/o: 0.00/2785.80/72.00) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 520s ] thds: 12 tps: 2876.80 qps: 2876.80 (r/w/o: 0.00/2805.70/71.10) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 530s ] thds: 12 tps: 2718.60 qps: 2718.60 (r/w/o: 0.00/2652.50/66.10) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 540s ] thds: 12 tps: 2594.20 qps: 2594.20 (r/w/o: 0.00/2530.50/63.70) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 550s ] thds: 12 tps: 2833.50 qps: 2833.50 (r/w/o: 0.00/2759.10/74.40) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 560s ] thds: 12 tps: 2794.10 qps: 2794.10 (r/w/o: 0.00/2719.90/74.20) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 570s ] thds: 12 tps: 2629.30 qps: 2629.30 (r/w/o: 0.00/2564.80/64.50) lat (ms,95%): 7.84 err/s: 0.00 reconn/s: 0.00
[ 580s ] thds: 12 tps: 2509.20 qps: 2509.20 (r/w/o: 0.00/2444.10/65.10) lat (ms,95%): 8.43 err/s: 0.00 reconn/s: 0.00
[ 590s ] thds: 12 tps: 2800.29 qps: 2800.29 (r/w/o: 0.00/2732.39/67.90) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 600s ] thds: 12 tps: 2832.64 qps: 2832.64 (r/w/o: 0.00/2761.45/71.20) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           1627422
        other:                           41192
        total:                           1668614
    transactions:                        1668614 (2780.97 per sec.)
    queries:                             1668614 (2780.97 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          600.0074s
    total number of events:              1668614

Latency (ms):
         min:                                    1.14
         avg:                                    4.31
         max:                                  284.19
         95th percentile:                        7.43
         sum:                              7197074.20

Threads fairness:
    events (avg/stddev):           139051.1667/128.56
    execution time (avg/stddev):   599.7562/0.00